#Узнать длину строки
hero_name = 'Hulk'
print(len(hero_name))

#Найти слово/букву в строке
hero_phrase = 'Hulk like fire, Tor like water'
print(hero_phrase.find('fire'))

#Возвести в верхний регистр
print(hero_name.upper())
